<img src = "https://miro.medium.com/v2/resize:fit:4800/format:webp/1*kK49KzkYEUYbFjVXrAEJxQ.jpeg" alt="Titanic Data Manipulation" width = "800" >

# I01 Data Manipulation using Pandas
** Bin Liao - bin.liao@unb.ca **

## Dataset Description:
For this assignment, I have chosen the ["Titanic: Machine Learning from Disaster"](https://www.kaggle.com/competitions/titanic) dataset from Kaggle. The dataset contains information about passengers on the Titanic, including their survival status, demographic information, cabin details, and ticket information. It fulfills the requirement of having at least three of the five dtypes: float, int, datetime, bool, and object.

In [90]:
import pandas as pd
import numpy as np
import os as os

# Read and prepare for the data:

# Define the data directory and file
data_dir = 'data'
data_file = 'titanic.csv'
file_path = os.path.join(data_dir, data_file)

# Define the URL where the data can be downloaded
url = 'https://raw.githubusercontent.com/Bencool/MBA6636-Business-Analytics/main/research/I01%20Data%20Manipulation%20using%20Pandas/data/titanic.csv'

# Check if the data file exists
if not os.path.isfile(file_path):
    # If not, check if the data directory exists
    if not os.path.isdir(data_dir):
        # If not, create the data directory
        os.makedirs(data_dir)
    
    # Download the data file
    print(f'Downloading file from github ...')
    !wget -O {file_path} {url}
    print(f'File downloaded and saved to {file_path}')

# Load data into a dataframe.
titanic = pd.read_csv(file_path)

# List the first few rows of the datafraom
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [91]:
#Check the available dataypes:
print(titanic.dtypes)

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

From the dtypes function, we could found that the data contains three datatype: integer, float, and objects(string).

## a. Index/ Reindex an alter row or column labels.

In [92]:
# Set 'PassengerId' coloumn as index
titanic.set_index('PassengerId', inplace=True)
titanic.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [93]:
# Reset the index
titanic.reset_index(inplace=True)
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [94]:
# Rename the 'SibSp' column to 'Siblings_Spouses'
titanic = titanic.rename(columns= {'SibSp' : 'Siblings_Spouses'})
titanic.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age',
       'Siblings_Spouses', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [95]:
# Convert the 'Survived' column from '0/1' to 'False/True' boolean.
def convert_to_bool(value):
    if value == 0:
        return False
    else:
        return True
    
titanic['Survived'] = titanic['Survived'].apply(convert_to_bool)

titanic[['Survived']].head()

   Survived
0     False
1      True
2      True
3      True
4     False

## b. Reshape or Aggregate the data frame using Pivot Tables

In [96]:
# Find out the destribution of passengers in terms of class and where they embaked from
passengers = pd.pivot_table(titanic, index = "Pclass", columns = 'Embarked', aggfunc='size')
print('Distribution of class and embaked')
print(passengers)

Distribution of class and embaked
Embarked   C   Q    S
Pclass
1         85   2  127
2         17   3  164
3         66  72  353

In [97]:
# Find out the distribution of survival within each gender.
survived = pd.pivot_table(titanic, index='Sex', columns='Survived', aggfunc='size')
print('Distribution of Survival:')
print(survived)

Distribution of Survival:
Survived  False  True
Sex
female       81   233
male        468   109

## c. Create new columns based on existing columns

Create a new cloumn call 'Title'. The value of the title will extra from the 'Name' column.

In [98]:
# Extract the title from the name
titanic['Title'] = titanic['Name'].str.extract(' ([A-Za-z]+)\.', expand=False)

# Check the first few rows to see if the title was extracted correctly
titanic[['Name', 'Title']].head(10)

                                                Name   Title
0                            Braund, Mr. Owen Harris      Mr
1  Cumings, Mrs. John Bradley (Florence Briggs Th...     Mrs
2                             Heikkinen, Miss. Laina    Miss
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)     Mrs
4                           Allen, Mr. William Henry      Mr
5                                   Moran, Mr. James      Mr
6                            McCarthy, Mr. Timothy J      Mr
7                     Palsson, Master. Gosta Leonard  Master
8  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)     Mrs
9                Nasser, Mrs. Nicholas (Adele Achem)     Mrs

## d.Discover two new functions from Pandas library which are not taught in the class

Reference from the panda documents ["General function"](https://pandas.pydata.org/docs/reference/general_functions.html)

- **.cut()** :This function is used to segment and sort data values into bins.<br>
    Demo to use the '.cut()' function to calssified the agegroup based on the ragne of the age.

In [99]:
# Define the bins and labels
bins = [0, 18, 35, 60, np.inf]
labels = ['Child', 'Young Adult', 'Adult', 'Senior']

# Use cut to create the AgeGroup column
titanic['AgeGroup'] = pd.cut(titanic['Age'], bins=bins, labels=labels)

titanic[['Age', 'AgeGroup']].head(10)

    Age     AgeGroup
0  22.0  Young Adult
1  38.0        Adult
2  26.0  Young Adult
3  35.0  Young Adult
4  35.0  Young Adult
5   NaN          NaN
6  54.0        Adult
7   2.0        Child
8  27.0  Young Adult
9  14.0        Child

- **.melt()**: THis function is used to transform or reshape data.<br>
Demo to use the melt() function to resape a small subset of the Titanic datase, indlucding the 'Survived' and 'Sex columns:

In [100]:
# Let's first create a smaller subset of the data
subset_df = titanic[['Survived', 'Sex']].head(100)

# Now use melt to reshape this data
melted_data = subset_df.melt(id_vars='Survived', value_vars='Sex')

melted_data.head(10)

   Survived variable   value
0     False      Sex    male
1      True      Sex  female
2      True      Sex  female
3      True      Sex  female
4     False      Sex    male
5     False      Sex    male
6     False      Sex    male
7     False      Sex    male
8      True      Sex  female
9      True      Sex  female